// === БАЗА ДАННЫХ СВЕЧЕЙ ===
window.DB_CANDLES = [
  {
    "id": "c_1780060753084",
    "name_ru": "Наташа внучка",
    "name_ua": "Наташа онука",
    "message_ru": "",
    "message_ua": "",
    "type": "heavenly",
    "timestamp": 1780060753084
  },
  {
    "id": "c_1780056662557",
    "name_ru": "Iryna",
    "name_ua": "Ірина",
    "message_ru": "",
    "message_ua": "",
    "type": "classic",
    "timestamp": 1780056662557
  },
  {
    "id": "c_1779910839880",
    "name_ru": "Ваша Таня",
    "name_ua": "Ваша Таня",
    "message_ru": "Бесконечно благодарю. Бесконечно люблю. Бесконечно прошу прощения.",
    "message_ua": "Безмежно дякую. Безмежно люблю. Безмежно прошу вибачення.",
    "type": "unquenchable",
    "timestamp": 1779910839880,
    "status": "approved"
  },
  {
    "id": "c_1779907724383",
    "name_ru": "Игорь",
    "name_ua": "Ігор",
    "message_ru": "Спасибо вам!",
    "message_ua": "Дякую вам!",
    "type": "classic",
    "timestamp": 1779907724383,
    "status": "approved"
  }
];

// === БАЗА ДАННЫХ ФОТОГАЛЕРЕЙ И ПОДПИСЕЙ ===
window.DB_GALLERIES = {
  "fatherGallery": [
    {
      "id": "gallery-f-3",
      "ru": "Миша",
      "ua": "Мишко"
    },
    {
      "id": "gallery-f-1780044314459",
      "ru": "Григорий Карпович, папа",
      "ua": "Григорій Карпович, тато"
    },
    {
      "id": "gallery-f-1780044317053",
      "ru": "Раиса Ивановна, мама",
      "ua": "Раїса Іванівна, мама"
    },
    {
      "id": "gallery-f-1780044265744",
      "ru": "",
      "ua": ""
    },
    {
      "id": "gallery-f-1",
      "ru": "",
      "ua": ""
    },
    {
      "id": "gallery-f-2",
      "ru": "",
      "ua": ""
    },
    {
      "id": "gallery-f-1779900681823",
      "ru": "Дочка Таня - гроза хулиганов в саду",
      "ua": "Дочка Таня - гроза хуліганів у саду"
    },
    {
      "id": "gallery-f-1779899393592",
      "ru": "Свадьба дочки",
      "ua": "Весілля доньки"
    },
    {
      "id": "gallery-f-1779899705550",
      "ru": "",
      "ua": ""
    },
    {
      "id": "gallery-f-4",
      "ru": "Слезы радости за дочку и внучку",
      "ua": "Сльози радості за доньку та онуку"
    },
    {
      "id": "gallery-f-1779900727575",
      "ru": "Семья",
      "ua": "Сім'я"
    },
    {
      "id": "gallery-f-1779899706295",
      "ru": "",
      "ua": ""
    },
    {
      "id": "gallery-f-1779899747826",
      "ru": "",
      "ua": ""
    },
    {
      "id": "gallery-f-1779899702764",
      "ru": "",
      "ua": ""
    },
    {
      "id": "gallery-f-1779899703683",
      "ru": "",
      "ua": ""
    },
    {
      "id": "gallery-f-1779900617232",
      "ru": "Внук Игорёша",
      "ua": "Онук Ігорьоша"
    },
    {
      "id": "gallery-f-1779900728388",
      "ru": "Семья",
      "ua": "Сім'я"
    },
    {
      "id": "gallery-f-1780044304340",
      "ru": "Папа в Филармонии",
      "ua": "Папа у Філармонії"
    },
    {
      "id": "gallery-f-1780045556917",
      "ru": "Лев Вайсфельд, друг семьи",
      "ua": "Лев Вайсфельд, друг сім'ї"
    },
    {
      "id": "gallery-f-1779900618498",
      "ru": "Бывший Кукольный театр",
      "ua": "Колишній Ляльковий театр"
    },
    {
      "id": "gallery-f-1780045555012",
      "ru": "",
      "ua": ""
    }
  ],
  "motherGallery": [
    {
      "id": "gallery-m-1",
      "ru": "Света",
      "ua": "Світлана"
    },
    {
      "id": "gallery-m-1780045033642",
      "ru": "Владимир Николаевич, папа",
      "ua": "Володимир Миколайович, тато"
    },
    {
      "id": "gallery-m-1780045034779",
      "ru": "Вера Гавриловна, мама",
      "ua": "Віра Гаврилівна, мамо"
    },
    {
      "id": "gallery-m-2",
      "ru": "",
      "ua": ""
    },
    {
      "id": "gallery-m-1780044960253",
      "ru": "Иркутск, школа",
      "ua": "Іркутськ, школа"
    },
    {
      "id": "gallery-m-1780045839389",
      "ru": "",
      "ua": ""
    },
    {
      "id": "gallery-m-3",
      "ru": "",
      "ua": ""
    },
    {
      "id": "gallery-m-1779900160892",
      "ru": "",
      "ua": ""
    },
    {
      "id": "gallery-m-4",
      "ru": "",
      "ua": ""
    },
    {
      "id": "gallery-m-1779900159746",
      "ru": "",
      "ua": ""
    },
    {
      "id": "gallery-m-1779900162591",
      "ru": "",
      "ua": ""
    },
    {
      "id": "gallery-m-1779900307645",
      "ru": "Гипроплодоовощхоз",
      "ua": "Гіпроплодоовочгосп"
    },
    {
      "id": "gallery-m-1779900348033",
      "ru": "",
      "ua": ""
    },
    {
      "id": "gallery-m-1780044702889",
      "ru": "",
      "ua": ""
    },
    {
      "id": "gallery-m-1779900420990",
      "ru": "Дочка Таня и любимая собака Бренда",
      "ua": "Донька Таня та улюблений собака Бренда"
    },
    {
      "id": "gallery-m-1780045012322",
      "ru": "",
      "ua": ""
    },
    {
      "id": "gallery-m-1779900240845",
      "ru": "",
      "ua": ""
    },
    {
      "id": "gallery-m-1779900243624",
      "ru": "",
      "ua": ""
    },
    {
      "id": "gallery-m-1779900245789",
      "ru": "",
      "ua": ""
    },
    {
      "id": "gallery-m-1779900350107",
      "ru": "",
      "ua": ""
    },
    {
      "id": "gallery-m-1779900350786",
      "ru": "Дочка - Магистр",
      "ua": "Донька - Магістр"
    },
    {
      "id": "gallery-m-1779900437670",
      "ru": "Внучка Наташенька",
      "ua": "Внучка Наташенька"
    },
    {
      "id": "gallery-m-1779900436270",
      "ru": "Внук Игореша",
      "ua": "Онук Ігорєша"
    },
    {
      "id": "gallery-m-1780044949641",
      "ru": "",
      "ua": ""
    }
  ]
};